print("Угадайте 1 слово:")
a = "чушь"
print("Собачья ....")
c = input("Введите слово: ")
if c == a:
    print("Вы выиграли!")
else:
    print("Вы проиграли(")
    c1 = input("Введите слово: ")
    if c1 == a:
        print("Вы выиграли!")
    else:
        print("Вы проиграли(")
        c2 = input("Введите слово: ")
        if c2 == a:
            print("Вы выиграли!")
        else:
            print("Вы проиграли(")
            c3 = input("Введите слово: ")
            if c3 == a:
                print("Вы выиграли!")
            else:
                print("Вы снова проиграли, правильное слово - чушь")

print("Угадайте 2 слово:")
d = "снег"
print("Белый ....")
e = input("Введите слово: ")
if e == d:
    print("Вы выиграли!")
else:
    print("Вы проиграли(")
    e1 = input("Введите слово: ")
    if e1 == d:
        print("Вы выиграли!")
    else:
        print("Вы проиграли(")
        e2 = input("Введите слово: ")
        if e2 == d:
            print("Вы выиграли!")
        else:
            print("Вы проиграли(")
            e3 = input("Введите слово: ")
            if e3 == d:
                print("Вы выиграли!")
            else:
                print("Вы снова проиграли, правильное слово - снег")

print("Угадайте 3 слово:")
g = "мир"
print("О дивный, новый ...")
j = input("Введите слово: ")
if j == g:
    print("Вы выиграли!")
else:
    print("Вы проиграли(")
    j1 = input("Введите слово: ")
    if j1 == g:
        print("Вы выиграли!")
    else:
        print("Вы проиграли(")
        j2 = input("Введите слово: ")
        if j2 == g:
            print("Вы выиграли!")
        else:
            print("Вы снова проиграли, правильное слово - мир")

print("Угадайте 4 слово:")
q = "сад"
print("Таинственный ...")
r = input("Введите слово: ")
if r == q:
    print("Вы выиграли!")
else:
    print("Вы проиграли(")
    r1 = input("Введите слово: ")
    if r1 == q:
        print("Вы выиграли!")
    else:
        print("Вы проиграли(")
        r2 = input("Введите слово: ")
        if r2 == q:
            print("Вы выиграли!")
        else:
            print("Вы снова проиграли, правильное слово - сад")

print("Угадайте 5 слово:")
l = "жук"
print("Эдгар Аллан По 'Золотой ...'")
n = input("Введите слово: ")
if n == l:
    print("Вы выиграли!")
else:
    print("Вы проиграли(")
    n1 = input("Введите слово: ")
    if n1 == l:
        print("Вы выиграли!")
    else:
        print("Вы проиграли(")
        n2 = input("Введите слово: ")
        if n2 == l:
            print("Вы выиграли!")
        else:
            print("Вы снова проиграли, правильное слово - жук")
    
